Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/unemployed_people/index.html.txt.tmx
Source language: en
Languages: ga

source: If you lose your job or are unemployed you may get a social welfare payment
ga: Má chailleann tú do phost, d’fhéadfá a bheith incháilithe d’íocaíocht leasa shóisialaigh a fháil

source: Information about the process of signing on for a jobseeker's payment
ga: Faigh amach conas íocaíocht leasa shóisialaigh a fháil nuair atá tú dífhostaithe

source: This is a weekly payment to people who have lost their job and are covered by social insurance
ga: Is íocaíocht sheachtainiúil é a dtugtar do dhaoine atá a bpost caillte acu agus atá ag lorg oibre

source: A means-tested payment to people who are unemployed and looking for work
ga: Íocaíocht a ndéantar fiosrú maoine uirthi agus a tugtar do dhaoine atá dífhostaithe agus ar lorg oibre

source: Means test for Jobseeker's Allowance
ga: Tástáil mhaoine don Liúntas Cuardaitheora Poist

source: To get Jobseeker's Allowance you must satisfy a means test
ga: Chun cáiliú don Liúntas Cuardaitheora Poist, caithfidh tú tástáil mhaoine a shásamh

source: A means test examines all your sources of income
ga: Le tástáil mhaoine, scrúdaítear d’fhoinsí ioncaim ar fad

source: However, some income is not taken into account in the calculation of your means
ga: Áfach, tá ioncam nach nglactar san áireamh agus d’fhoinsí ioncaim á ríomh

source: This document is in: Social Welfare > Irish social welfare system > Means test for social welfare payments
ga: This document is in: Leas Sóisialach > Córas Leasa Shóisialaigh na hÉireann > Tástáil Acmhainne le haghaidh Íocaíochtaí Leasa Shóisialaigh

source: Jobseeker's Allowance and work
ga: Liúntas Cuardaitheora Poist agus obair

source: Explains how your income from work and your spouse's income from work can affect your rate of Jobseeker's Allowance
ga: Déanann sé cur síos ar an mbealach is féidir le d'ioncam ó obair agus ioncam ó obair do chéile tionchar a bheith acu ar do ráta Liúntais Cuardaitheora Poist

source: Jobseeker's Benefit and work
ga: Obair agus Sochar Cuardaitheora Poist

source: You may be able to work and get Jobseeker's Benefit
ga: Tá cúinsí ann inar féidir leat a bheith ag obair agus Sochar Cuardaitheora Poist a fháil

source: This document explains how work affects your Jobseeker's Benefit
ga: Déanann sé cur síos ar an mbealach is féidir le d'ioncam ó obair agus ioncam fostaíochta do chéile/pháirtí tionchar a bheith acu ar do ráta Sochair Cuardaitheora Poist

source: This document is in: Social Welfare > Social welfare payments > Social welfare payments and work
ga: This document is in: Leas Sóisialach > Íocaíochtaí Leasa Shóisialaigh > Íocaíochtaí Leasa Shóisialaigh agus Obair

source: The Pre-Retirement Allowance is a means-tested payment for people aged 55 and over who consider themselves retired rather than unemployed
ga: Is íocaíocht scrúdú maoinithe é seo do dhaoine atá 55 bliain d'aois nó os a chionn, a fheiceann iad féin mar daoine scortha in áit daoine dífhostaithe

source: Since 4 July 2007, the Pre-Retirement Allowance is closed to new applicants but existing recipients may continue to get it
ga: Ní ghlacfar le haon iarratas nua le haghaidh Liúntas Réamhscoir ó 4 Iúil 2007 ar aghaidh ach is féidir le faighteoirí reatha leanúint é a fháil

source: If your business has closed or if you are self-employed but have less work and less income than before you may qualify for a social welfare payment
ga: An bhfuil tú féinfhostaithe agus is lú obair agus ioncam agat? Faigh amach dá bhfaighfeá íocaíocht leasa shóisialaigh

source: Signing off when you start work
ga: Ag síniú de nuair a thosnaíonn tú ag obair

source: You are required to notify your Intreo centre or local social welfare office if you have been claiming social welfare benefits and are returning to work
ga: Tá an dualgas ort a chur in iúil don oifig áitiúil leasa shoisialaigh ma bhí tú ag éileamh sochar leasa shosialaigh in Eirinn agus má tá tú ag filleadh ar obair

source: Conditions for getting a jobseeker's payment
ga: Coinníollacha chun íocaíocht cuardaitheora poist a fháil

source: The conditions you must meet to get a jobseeker’s payment and the penalties that apply if you do not meet these conditions
ga: Na coinníollacha nach mór duit a chomhlíonadh chun íocaíocht cuardaitheora poist a fháil agus na pionóis a bheidh i bhfeidhm mura gcomhlíonann tú na coinníollacha sin

source: Employment services for jobseekers
ga: Daoine scothaosta agus íocaíochtaí cuardaitheora poist

source: A summary of the Department of Social Protection’s employment services for jobseekers
ga: Forbhreathnú ar na forálacha speisialta a bhaineann le cuardaitheoirí poist scothaosta

source: Information for younger jobseekers
ga: Faisnéis do chuardaitheoirí poist óga

source: Younger jobseekers must meet the same conditions as all other jobseekers but there are some targeted supports to help them into work
ga: Caithfidh cuardaitheoirí poist óga comhlíonadh a dhéanamh ar na coinníollacha céanna nach mór do chuardaitheoirí eile poist iad a chomhlíonadh ach is ann do roinnt tacaí spriocdhírithe freisin chun cabhrú leo obair a fháil

source: The Jobseeker's Transitional payment is a special payment for lone parents whose youngest child is aged between 7 and 13 years
ga: A summary of the Department of Social Protection’s employment services for jobseekers

source: Older people and jobseeker's payments
ga: Socrú idirthréimhseach Liúntas Cuardaitheora Poist

source: An overview of the special provisions that apply to older jobseekers and people who retire early
ga: Faisnéis faoin íocaíocht agus conas iarratas a dhéanamh

source: Most Read in "Social Welfare"
ga: Ábhar is mó éilimh i "Leas Sóisialach"

source: Back to School Clothing and Footwear Allowance
ga: Liúntas Éadaí agus Coisbhirt chun Filleadh ar Scoil
